artillery_load.yml
config:
  target: 'http://localhost:3003'
  phases:
    - duration: 5
      arrivalRate: 10
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - get:
        url: "/support/4999999"
    - get:
        url: "/support/333"
    - get:
        url: "/support/9999999"
    - get:
        url: "/support/9999977"
    - get:
        url: "/support/9999000"
    - get:
        url: "/support/9999989"
    - get:
        url: "/support/9999799"
    - get:
        url: "/support/9999899"
    - get:
        url: "/support/9999998"
    - get:
        url: "/support/9939999"
    - get:
        url: "/support/9994999"
    # - post:
    #     url: "/support/"
    #     json: {
    #             "albumID": 0000,
    #             "comments": [
    #                 {
    #                     "username": "Chagil Guiab",
    #                     "avatar": "http://lorempixel.com/640/480/cats",
    #                     "text": "Retro crucifix Pitchfork next level. Cray tousled tattooed meggings 8-bit disrupt 3 wolf moon occupy."
    #                 },
    #                 {
    #                     "username": "M Brock Ross III",
    #                     "avatar": "http://lorempixel.com/640/480/cats",
    #                     "text": "Skateboard next level crucifix swag next level cray. Chambray bitters sriracha."
    #                 },
    #                 {
    #                     "username": "Derrick Brandon PhD",
    #                     "avatar": "http://lorempixel.com/640/480/cats",
    #                     "text": "Williamsburg hoodie hashtag XOXO hashtag post-ironic selfies flannel. Aesthetic messenger bag kitsch lomo cornhole."
    #                 }
    #             ]
    #         }